/* Нужно учитывать тот факт что моим продуктом могут пользоваться люди с ограничеными возможностяси, например люди
с плохий зрением или люди которые не могут пользоваться мышкой и тд 
   Здесь на помощь приходит aria, которая В РЕАКТЕ КАК И ДЕЙТА АТРИБУТЫ ИМЕЮТ ИСКЛЮЧЕНИЕ И ЗАДАЮТСЯ ТАК ЖЕ КАК И 
В ОБЫЧНОЙ ВЕРСТКЕ, ПРИ ТОМ ЧТО ЭТО ВСЕ ИСКЛЮЧЕНИЕ, БОЛЬШЕ НЕТ. То-есть ну нужно камелкейсом будет писать а через -
   Здесь так же появляется понимание зачем нужны alt аттрибуты для изображений что бы человеку было легче прочитать
   
   Семантика - это ПРЕЖДЕ ВСЕГО ОТДЕЛЯТЬ ШАПКУ header, потом nav как навигацию, РЕКЛАМУ aside, 
Отделять section и article и использовать footer 

    Представь что у пользователя сломалась мышка и он должен пользоваться нашим сайтом без нее. Например табом мы 
мы можем переключаться между инпутами, но самое главное - это свойство outline которая нам показывать на сайте
где фокус что людям с огран возможностями и теми кто сидит за компом без клавы очень помогает ! 

https://ru.reactjs.org/docs/accessibility.html
http://prgssr.ru/development/ispolzovanie-aria-v-html5.html
https://developer.mozilla.org/ru/docs/Web/Accessibility/ARIA
https://ru.wikipedia.org/wiki/%D0%AD%D0%BA%D1%80%D0%B0%D0%BD%D0%BD%D0%BE%D0%B5_%D1%81%D1%87%D0%B8%D1%82%D1%8B%D0%B2%D0%B0%D1%8E%D1%89%D0%B5%D0%B5_%D1%83%D1%81%D1%82%D1%80%D0%BE%D0%B9%D1%81%D1%82%D0%B2%D0%BE
https://youtu.be/KAK-WAb9vow
https://www.youtube.com/watch?v=bDYEnNzprzE 
*/